#include <iostream>

struct Комплексне_Число {
    double реальна;
    double уявна;
};

// Функція додавання комплексних чисел
Комплексне_Число додавання(Комплексне_Число a, Комплексне_Число b) {
    return { a.реальна + b.реальна, a.уявна + b.уявна };
}

// Функція віднімання комплексних чисел
Комплексне_Число віднімання(Комплексне_Число a, Комплексне_Число b) {
    return { a.реальна - b.реальна, a.уявна - b.уявна };
}

// Функція множення комплексних чисел
Комплексне_Число множення(Комплексне_Число a, Комплексне_Число b) {
    return { a.реальна * b.реальна - a.уявна * b.уявна, a.реальна * b.уявна + a.уявна * b.реальна };
}

// Функція ділення комплексних чисел
Комплексне_Число ділення(Комплексне_Число a, Комплексне_Число b) {
    double знаменник = b.реальна * b.реальна + b.уявна * b.уявна;
    return { (a.реальна * b.реальна + a.уявна * b.уявна) / знаменник, (a.уявна * b.реальна - a.реальна * b.уявна) / знаменник };
}

int main() {
    Комплексне_Число комплексне_число1 = { 2.0, 3.0 };
    Комплексне_Число комплексне_число2 = { 1.0, -1.0 };

    // Додавання
    Комплексне_Число сума = додавання(комплексне_число1, комплексне_число2);
    std::cout << "Сума: " << сума.реальна << " + " << сума.уявна << "i" << std::endl;

    // Віднімання
    Комплексне_Число різниця = віднімання(комплексне_число1, комплексне_число2);
    std::cout << "Різниця: " << різниця.реальна << " + " << різниця.уявна << "i" << std::endl;

    // Множення
    Комплексне_Число добуток = множення(комплексне_число1, комплексне_число2);
    std::cout << "Множення: " << добуток.реальна << " + " << добуток.уявна << "i" << std::endl;

    // Ділення
    Комплексне_Число частка = ділення(комплексне_число1, комплексне_число2);
    std::cout << "Ділення: " << частка.реальна << " + " << частка.уявна << "i" << std::endl;

    return 0;
}